# SQL

In [ ]:
# libreria SQL
import sqlite3 as sql
import pandas as pd

In [ ]:
# cargar bases de datos
employees = pd.read_csv('C:/Users/Diego/OneDrive/Documents/GitHub/tesis_maestria/tesis_maestria/employees.csv')
employees

In [ ]:
# conectar SQLite3 a base de datos
conn = sql.connect('employees.db')

# convertir bases de datos a 
# 
# db SQL
#employees.to_sql('employees.db1', conn)
# crear cursos para ejectuar SQL queries
# cursor.execute("SQL QUERY")
cursor = conn.cursor()

conn.commit()

# Basic Clauses

## SELECT

Seleccionar columans de tabla 

* operaciones matematicas
* convertir a char
* crear nuevas columnas

In [ ]:
SELECT <columna1>, <columna2>, <columna3>,
    <literal>, <expression>
FROM <tabla1>

In [ ]:
CONCAT(column1, 'literal', column2)
OR
<column> || <column>
<literal> || <literal>

In [ ]:
# seleccionar * todas las columnas y filas de tabla "employees"

SELECT * FROM "alanparadise/nw"."employees";

In [ ]:
# seleccionar columnas 'employeeid', 'lastname', 'firstname' de tabla 'employees"
SELECT employeeid, lastname, firstname 
FROM "alanparadise/nw"."employees";

In [ ]:

# seleccionar columnas 'lastname', 'firstname', 'hiredate', 'current_date', 'date_part' de tabla "employees"
SELECT lastname, firstname, hiredate, current_date, date_part('month',hiredate)
FROM "alanparadise/nw"."employees";

In [ ]:
# seleccionar columnas orderid, unitprice, quantity
# expresion "Total Value"=unitprice*quantity
# de tabla "orderdetails"
SELECT orderid, unitprice, quantity, 
    unitprice*quantity as "Total Value"
FROM "alanparadise/nw"."orderdetails";

In [ ]:
# seleccionar columnas lastname, firstname,
# expresion "Hire Month"= char(hiredate, 'month')
# de tabla "employees"
SELECT lastname, firstname,
    to_char(hiredate, 'month') as "Hire Month"
FROM "alanparadise/nw"."employees";

In [ ]:
# concatenar(unir) por columnas "Full Name"= firstname,' ',lastname  
# de tabla "employees"
SELECT concat(firstname,' ',lastname) as "Full Name"
FROM "alanparadise/nw"."employees";

In [ ]:
# 2.1 List all the products in the Northwinds database showing productid, productname, quantity per unit, unitprice, and unitsinstock.
SELECT  productid, productname, quantityperunit, unitprice, unitsinstock
FROM "alanparadise/nw"."products ";

In [ ]:
# 2.2 For all employees at Northwinds, list the first name and last name concatenated together with a blank space in-between, and the YEAR when they were hired.  
SELECT concat(firstname,' ',lastname) as "Full Name",
to_char(hiredate, 'year') as "Hire Year"
FROM "alanparadise/nw"."employees";

In [ ]:
 # 2.3 For all products in the Northwinds database, list the productname, unitprice, unitsinstock,  and the total value of the inventory of that product as “Total Value”.  (HINT:  total value = unitsinstock * unitprice.) 
SELECT  productname, unitprice, unitsinstock,
    unitsinstock*unitprice as "Total Value"
FROM "alanparadise/nw"."products";

In [ ]:
#  2.4 For all employees at Northwinds, list the first name and last name concatenated together with a blank space in-between with a column header “Name”, and the name of the month (spelled out) for each employee’s birthday.  
SELECT concat(firstname,' ',lastname) as "Name",
    to_char(birthdate, 'month') as "Birthdate Month"
FROM "alanparadise/nw"."employees";

## WHERE 

Definir condición sobre las columnas seleccionadas SELECT para filtrar las filas

Operands son: columnas, literales y expresiones

Operator son:

* = Igual
* != NO igual
* <> NO igual
* > mayor que
* >= mayor o igual que 
* < menor que
* <= menor o igual que 
* like 
* between
* in

In [ ]:
SELECT <column1>, <column2>, <column3>,
<literal>, <expression> AS <alias>
FROM <table>
WHERE < operand > < operator > < operand >;

In [ ]:
# seleccionar columnas customerid, contactname, country
# de tabla "customers"
SELECT customerid, contactname, country
FROM  "alanparadise/nw"."customers";

In [ ]:
# seleccionar columnas customerid, contactname, country
# de tabla "customers"
# condicion(donde) pais igual 'Brazil'
SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
WHERE country = 'Brazil';

In [ ]:
# seleccionar columnas customerid, contactname, country
# de tabla "customers"
# condicion(donde) pais NO igual 'Brazil'
SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
WHERE country <> 'Brazil';

In [ ]:
# seleccionar columnas: productid, productname, unitprice
# de tabla "products"
# condicion(where) unitprice mayor que igual 60
SELECT productid, productname, unitprice
FROM "alanparadise/nw"."products"
WHERE unitprice > 60;

### LIKE operator
Igual que para columnas tipo texto/string 

* % 0 o más caracteres
* _ exactamente 1 de cualquier caracter

In [ ]:
# seleccionar columnas: customerid, contactname, country
# tabla "customers"
# condicion(where) contactname like(string/text) 'M%', 0 o más caratereres M en texto

SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
WHERE contactname like 'M%';

In [ ]:
# seleccionar columnas: customerid, contactname, country
# tabla "customers"
# condicion(where) contactname like(string/text) 'M%', exactamente 1 caracter M en texto

SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
WHERE contactname like '%M%';

In [ ]:
# seleccionar columnas: customerid, contactname, country
# tabla "customers"
# condicion(where) contactname like(string/text) '_a%', exactamente 1  o más caracteres a en texto

SELECT customerid, contactname, country
FROM "alanparadise/nw"."customers"
WHERE contactname like '_a%';

### IN operator

Definir condición de pertenencia sobre las columnas o literales
TRUE/FALSE 

WHERE operand IN (value, value, value)

WHERE operand = value1 OR
operand = value2 OR
operand = value3 


* value debe ser columna o literal 
* value debe tener misma estructura de dato de operand

In [ ]:
# seleccionar columnas: productid, productname, unitprice, supplierid
# tabla "products"
# condicion(where) supplierid in(pertenencia)  (2, 4, 6, 8)
SELECT productid, productname, unitprice, supplierid
FROM "alanparadise/nw"."products"
WHERE supplierid IN (2, 4, 6, 8);

In [ ]:
# seleccionar columnas: supplierid, companyname, region
# tabla "suppliers"
# condicion(where) region in(pertenencia)  ('LA', 'MI', 'OR')
SELECT supplierid, companyname, region
FROM "alanparadise/nw"."suppliers"
WHERE region IN ('LA', 'MI', 'OR');

### BETWEEN operator

Definir condición de pertenencia a un rango sobre las columnas
TRUE/FALSE 

WHERE operand between value1 and value2

WHERE operand >= value1 AND
operand <= value2

* BETWEEN es inclusivo
* value debe tener la misma estructura de dato que operand

In [ ]:
# seleccionar columnas: ProductID, ProductName, UnitPrice
# tabla "products"
# condicion(where) UnitPrice BETWEEN(entre)  20 y 30

SELECT ProductID, ProductName, UnitPrice
FROM "alanparadise/nw"."products"
WHERE UnitPrice BETWEEN 20 and 30;

In [ ]:
# seleccionar columnas: Lastname, Firstname
# tabla "employees"
# condicion(where) Lastname BETWEEN(entre)  'A' y 'B'
SELECT Lastname, Firstname
FROM "alanparadise/nw"."employees"
WHERE Lastname BETWEEN 'A' and 'M';

In [ ]:
# seleccionar columnas: customerid, contactname, region, country
# tabla "customers"
# condicion(where) NOT country 'Brazil'
SELECT customerid, contactname, region, country
FROM "alanparadise/nw"."customers"
WHERE NOT country = 'Brazil';

In [ ]:
# seleccionar columnas: Productname, SupplierID, CategoryID,UnitPrice, UnitsInStock
# tabla "products"
# condicion(where) AND/OR
SELECT Productname, SupplierID, CategoryID,UnitPrice, UnitsInStock
FROM "alanparadise/nw"."products"

WHERE SupplierID = 1 AND CategoryID = 2 OR
CategoryID = 3 AND UnitPrice > 20 OR
UnitsInStock < 12;

In [ ]:
# seleccionar columnas: Productname, SupplierID, CategoryID,UnitPrice, UnitsInStock
# tabla "products"
# condicion(where) AND/OR
SELECT Productname, SupplierID, CategoryID,UnitPrice, UnitsInStock
FROM "alanparadise/nw"."products"
WHERE SupplierID = 1 AND 
(CategoryID = 2 OR CategoryID = 3 AND UnitPrice > 20) OR
UnitsInStock < 12;

Multiple conditions in a WHERE clause can be combined with
"AND", "OR"
Any condition in a WHERE clause can be negated with
"NOT"

In [ ]:
#2.1 List the customerid, companyname, and country for all customers NOT in the U.S.A.
SELECT customerid, companyname, country
FROM "alanparadise/nw"."customers"
WHERE NOT country = 'USA';

In [ ]:
#2.2 For all products in the Northwinds database, list the productname, unitprice, unitsinstock,  and the total value of the inventory of that product as “Total Value” for all products with a Total Value greater than $1000.  (HINT:  total value = unitsinstock * unitprice) 
SELECT productname, unitprice, unitsinstock,
    unitsinstock*unitprice as "Total Value"
FROM  "alanparadise/nw"."products"
WHERE (unitsinstock*unitprice) > 1000;

In [ ]:
#2.3 List the productid, productname, and quantityperunit for all products that come in bottles.  

SELECT productid, productname, quantityperunit
FROM  "alanparadise/nw"."products"
WHERE quantityperunit LIKE '%bottles%';

In [ ]:
#2.4 List the productid, productname, and unitprice for all products whose categoryid is an ODD number.   (HINT:  categoryid is a one digit integer less than 9 …) 
SELECT categoryid, productid, productname, unitprice
FROM "alanparadise/nw"."products"
WHERE categoryid IN (1,3,5,7);

In [ ]:
#2.5 List the orderid,  customerid, and shippeddate for orders that shipped to Canada  in December 1996 through the end of  January 1997.

SELECT orderid,  customerid, shippeddate
FROM "alanparadise/nw"."orders"

WHERE shipcountry LIKE '%Canada%' AND 
shippeddate BETWEEN '1996-12-01 00:00:00' and '1997-01-31 00:00:00';

## ORDERBY
Ordenar filas ASC-DESC

In [ ]:
# seleccionar columnas: productname, unitprice
# tabla "products"
# ordenar (order by) productname

SELECT productname, unitprice
FROM "alanparadise/nw"."products"
ORDER BY productname;

In [ ]:
# seleccionar columnas: productname, unitprice
# tabla "products"
# ordenar (order by) unitprice DESC descendente

SELECT productname, unitprice
FROM "alanparadise/nw"."products"
ORDER BY unitprice DESC;

In [ ]:
# seleccionar columnas: productname, unitprice
# tabla "products"
# ordenar (order by) columna 2 DESC descendente

SELECT productname, unitprice
FROM "alanparadise/nw"."products"
ORDER BY 2 desc;

### DISTINCT 

Quita valores duplicados

### COUNT ()

Cuenta filas o valores NO-Nulos en columna

In [ ]:
# contar todas las filas
# tabla "customers"
SELECT COUNT(*)
FROM "alanparadise/nw"."customers";

In [ ]:
# contar paises 
# tabla "customers"
SELECT COUNT(country)
FROM "alanparadise/nw"."customers";

In [ ]:
# contar paises distintos
# tabla "customers"
SELECT COUNT(DISTINCT country)
FROM "alanparadise/nw"."customers";

### LIMIT

Limita el número de filas

In [ ]:
# seleccionar columnas: productname, unitprice
# tabla "products"
# ordenar (order by) unitprice descendente limitar a 5 filas

SELECT productname, unitprice
FROM "alanparadise/nw"."products"
ORDER BY unitprice DESC LIMIT 5;

## GROUP FUNCTIONS

* crea tabla intermedia
* procesa la función GROUP con la respuesta intermedia
* WHERE determina el número de filas en la respuesta intermedia
* GROUP hace el calculo con las filas en al respuesta intermedia DESPUES del WHERE

* SUM: suma valores NO-Null en columna (solo columnas numericas)
* AVG: promedio de valores NO-Null en columna (solo columnas numericas)
* COUNT: cuenta valores NO-Null en columna
* MIN: fila mínima  NO-Null en columna
* MAX: fila máxima NO-Null en columna

In [ ]:
# contar todos los empleados = "Staff Size"
# tabla "employees"
SELECT COUNT(*) as "Staff Size"
from "alanparadise/nw"."employees";

In [ ]:
# contar paises distintos  = "Countries"
# tabla "customers"
SELECT COUNT(Distinct Country) as "Countries"
FROM  "alanparadise/nw"."customers";

In [ ]:
# sumar unitsinstock = "Inventory"
# tabla "products"
SELECT SUM(unitsinstock) as "Inventory"
FROM "alanparadise/nw"."products";

In [ ]:
# maximo unitprice = "High Price"
# tabla "products" 
SELECT MAX(unitprice) as "High Price"
FROM "alanparadise/nw"."products";

In [ ]:
# minimo unitprice = "Low Price"
# tabla "products" 
SELECT MIN(unitPrice) as "Low Price"
from "alanparadise/nw"."products";

In [ ]:
# promedio unitprice =  "Average Price"
# tabla "products"
SELECT AVG(unitprice) as "Average Price"
FROM "alanparadise/nw"."products";

In [ ]:
# convertir a char 
# promedio de UnitPrice = "Average Price"
# tabla "products"
SELECT to_char(avg(UnitPrice),'999,999.99') as "Average Price"
FROM "alanparadise/nw"."products";

In [ ]:
# contar empleados = "Staff Size" 
# tabla "employees"
SELECT COUNT(*) as "Staff Size"
FROM "alanparadise/nw"."employees";

In [ ]:
# contar employeeid  = "Staff Size"
SELECT COUNT(employeeid) as "Staff Size"
FROM "alanparadise/nw"."employees";

## GROUP BY

Genera sub totales.
Agrupa un subset de filas de la tabla intermedia

In [ ]:
# seleccionar columnas: OrderID
# sumar(UnitPrice) = "Total Price"
# sumar(Quantity) = "Total Quantity" 
# tabla "orderdetails"
# condicion(donde) OrderID EN (10248, 10249, 10250, 10251)
# agrupar por columna OrderID
SELECT OrderID, SUM(UnitPrice) as "Total Price",
SUM(Quantity) as "Total Quantity"

FROM "alanparadise/nw"."orderdetails"
WHERE OrderID in (10248, 10249, 10250, 10251)
GROUP BY OrderID;


Cuando se usa GROUP BY, cada columna/expresión de SELECT debe:
* aplicar una group function
* columna agrupada con group by

In [ ]:
# seleccionar columnas: country
# contar customerid = "Total"
# tabla "customers"
# agrupar por pais
SELECT country, count(customerid) as "Total"
FROM "alanparadise/nw"."customers"
GROUP BY country;

In [ ]:
# seleccionar columnas: supplierid
# promedio unitprice = "Total"
# tabla "products"
# agrupar por supplierid 
SELECT supplierid, avg(unitprice) as "Total"
FROM "alanparadise/nw"."products"
GROUP BY supplierid;

In [ ]:
# seleccionar columnas: SupplierID
# sumar UnitsInStock = "Inventory"
# tabla "products"
# agrupar por supplierid 
# ordenar por SUM(UnitsInStock) descendente, limite 1

SELECT SupplierID, SUM(UnitsInStock)AS "Inventory"
FROM "alanparadise/nw"."products"
GROUP BY SupplierID
ORDER BY 2 DESC LIMIT 1;

### HAVING

Condicion sobre subset de filas de tabla con funciones group.


Usar GROUP BY, HAVING es como WHERE contra la tabla intermedia.

In [ ]:
# seleccionar columnas: country
# contar customerid = "Total"
# tabla "customers"
# agrupar por country
# condicion (HAVING+GROUP BY) count(customerid) mayor a 5
# ordenar por  count(customerid) descendente 
SELECT country, count(customerid) as "Total"
FROM "alanparadise/nw"."customers"
GROUP BY country
HAVING count(customerid) > 5
ORDER BY 2 DESC;

In [ ]:
# 2.1 List the total (unitprice * quantity) as “Total Value”  by orderid for the top 5 orders.  (That is, the five orders with the highest Total Value.) 
SELECT SUM(unitprice*quantity) as "Total Value"
FROM "alanparadise/nw"."orderdetails"
GROUP BY (unitprice*quantity) DESC LIMIT 5;

In [ ]:
# 2.2 How many products does Northwinds have in inventory?
SELECT COUNT(unitsinstock)
FROM "alanparadise/nw"."products"
WHERE unitsinstock <> 0

In [ ]:
# 2.3 How many products are out of stock? 
SELECT COUNT(productid)
FROM "alanparadise/nw"."products"
WHERE unitsinstock=0;

In [ ]:
# 2.4 From which supplier(s) does Northwinds carry the fewest products? 

SELECT supplierid, unitsinstock
FROM "alanparadise/nw"."products"
ORDER BY unitsinstock ASC LIMIT 10;

In [ ]:
# 2.5 Which Northwinds employees (just show their employeeid) had over 100 orders ? 

SELECT employeeid, count(orderid) AS "Orders" 
FROM "alanparadise/nw"."orders"
       GROUP BY employeeid
       HAVING count(orderid) > 100
       ORDER BY 2 desc;

## Sub Queries

Query dentro de un Query

* WHERE: La tabla 'interna' se aplica un where(condición) a la tabla 'externa'
* SELECT: la tabla 'interna' se usa como columna en SELECT
* FROM: la tabla 'interna' se usa como tabla 'virtual' de FROM

In [ ]:
# QUERY EXTERNO
# seleccionar columnas: productID, productname, unitprice
# tabla "products"

# QUERY INTERNO
# condicion(where) maximo UnitPrice 
# seleccionar maximo UnitPrice
# tabla "products"
SELECT productID, productname, unitprice
FROM "alanparadise/nw"."products"

WHERE UnitPrice = (
SELECT MAX(UnitPrice)
FROM "alanparadise/nw"."products" )

In [ ]:
# QUERY EXTERNO
# seleccionar customerID, orderID
# tabla "orders"

# QUERY INTERNO
# seleccionar orderID tabla  "orders" en   orderID tabla "orderdetails" (2 tablas)
# tabla "orderdetails"
# condicion(where) quantity mayor a 100
# ordenar por CustomerID

SELECT customerID, orderID
FROM "alanparadise/nw"."orders"

WHERE orderID in (
SELECT orderID
FROM "alanparadise/nw"."orderdetails"
WHERE quantity > 100 )
ORDER BY CustomerID

In [ ]:
# QUERY EXTERNO
# seleccionar columnas productname

# QUERY INTERNO
#  sumar (UnitPrice * quantity)
# tabla "orderdetails"
# condicion(where) "orderdetails".productid ="products".productid = "Total"
# tabla "products"
SELECT productname, (select sum(UnitPrice * quantity)
FROM "alanparadise/nw"."orderdetails"
WHERE "alanparadise/nw"."orderdetails".productid =
"alanparadise/nw"."products".productid) as "Total"
FROM "alanparadise/nw"."products"

In [ ]:
# QUERY EXTERNO
# columnas: orderID

# QUERY INTERNO
# seleccionar columnas orderID, sumar quantity
# tabla "orderdetails"
# agrupar por columna OrderID (regla)
# condicion(having) suma(quantity) <100 = DetailCount

SELECT orderID
FROM (SELECT orderID, SUM(quantity)
FROM "alanparadise/nw"."orderdetails"
GROUP BY OrderID
HAVING SUM(quantity) < 100) AS DetailCount

Co-Related SubQuery

Tipo especial de subquery
* Query interno hace referencia a value de  Query externo
* Query interno se ejecuta cada vez que Query externo retorna otra fila

In [ ]:
# QUERY EXTERNO 
# seleccionar columnas O.employeeID, orderID, shipcity, customerID
# tabla "orders"
# QUERY INTERNO 
# condicion(where) employeeID en columnas employeeID FROM "alanparadise/nw"."employees" E
# condicion(where) E.City = O.shipcity  empleados donde empleado envio ordenes a ciudad de residencia de empleado

SELECT O.employeeID, orderID, shipcity, customerID
FROM "alanparadise/nw"."orders" O
WHERE employeeID IN
(SELECT employeeID FROM "alanparadise/nw"."employees" E
WHERE E.City = O.shipcity);

# JOIN

Unir tablas con key-columna (foreign key) en 2 tablas.

Las keys/columnas no deben tener el mismo nombre, sino el mismo tipo de dato y tamaño.

## Inner Join

In [ ]:
# seleccionar columnas:LastName, Firstname
# contar OrderID= "Order Total"
# 2 tablas: "employees","orders"
# condicion(where) "employees"."employeeid"="orders"."employeeid"
# agrupar por LastName, FirstName
# ordenar por 3=count(OrderID) descendente

SELECT LastName, Firstname, count(OrderID) as "Order Total"
from "alanparadise/nw"."employees","alanparadise/nw"."orders"
where "alanparadise/nw"."employees"."employeeid" ="alanparadise/nw"."orders"."employeeid"
GROUP BY LastName, FirstName
Order By 3 desc;

In [ ]:
# seleccionar columnas:LastName, Firstname, "employees".employeeid
# contar OrderID= "Order Total"
# 2 tablas: "employees","orders"
# condicion(where) "employees"."employeeid"="orders"."employeeid"
# agrupar por LastName, FirstName
# ordenar por 3=count(OrderID) descendente
SELECT "alanparadise/nw"."employees".employeeid, LastName, Firstname,count(OrderID) as "Order Total"
FROM "alanparadise/nw"."employees","alanparadise/nw"."orders"
WHERE "alanparadise/nw"."employees"."employeeid" =
"alanparadise/nw"."orders"."employeeid"
GROUP BY "alanparadise/nw"."employees".employeeid, LastName, FirstName
Order By 3 desc;

In [ ]:

# agregar 'alias' a las tablas por el Query para simplificar relation de bases
SELECT LastName, Firstname, count(OrderID) as "Order Total"
FROM "alanparadise/nw"."employees" E,
"alanparadise/nw"."orders" O
where E.employeeid = O.employeeid
GROUP BY LastName, FirstName
Order By 3 desc;

Inner Join explicito:


where E.employeeid = O.employeeid

In [ ]:
SELECT LastName, Firstname, count(OrderID) as "Order Total"
from "alanparadise/nw"."employees" E,
"alanparadise/nw"."orders" O
where E.employeeid = O.employeeid
GROUP BY LastName, FirstName
Order By 3 desc;

Inner Join implicito

FROM "alanparadise/nw"."employees" E JOIN
"alanparadise/nw"."orders" O
on E.employeeid = O.employeeid

In [ ]:
SELECT LastName, Firstname, count(OrderID) as "Order Total"
FROM "alanparadise/nw"."employees" E JOIN
"alanparadise/nw"."orders" O
on E.employeeid = O.employeeid
GROUP BY LastName, FirstName
Order By 3 desc;

In [ ]:
# 2.1 List each order and its Total Value (unitprice * quantity) for all orders shipping into France in descending Total Value order.

# seleccionar O.orderID
# sumar (unitprice * quantity) = "Total Value"
# tablas: "orders" O  JOIN "orderdetails" D, key: O.orderid = D.orderid
# condicion(where) shipcountry = 'France'
# agrupar por O.orderID
# ordenar por "Total Value" descendente

SELECT O.orderID, sum(unitprice * quantity) as "Total Value" 
FROM "alanparadise/nw"."orders" O  JOIN "alanparadise/nw"."orderdetails" D 
ON O.orderid = D.orderid
            
WHERE shipcountry = 'France'
GROUP BY O.orderid
ORDER BY 2 DESC;

In [ ]:
# 2.2 Create a Suppliers List showing Supplier CompanyName, and names of all the products sold by each supplier located in Japan. 
# seleccionar columnas: companyname, productname 
# 2 tablas: "suppliers" S  JOIN "products" P, key: S.supplierid = P.supplierid
# condicion(where) country = 'Japan'

SELECT companyname, productname 
FROM "alanparadise/nw"."suppliers" S  JOIN "alanparadise/nw"."products" P 
ON S.supplierid = P.supplierid
WHERE country = 'Japan';

In [ ]:
# 2.3 Create a “Low Performers” list showing the employees who have less than $100,000 in total sales.  List the employee’s LastName, FirstName followed by their total sales volume (the total dollar value of their orders.)    

# seleccionar columnas: LastName, FirstName, "Total Sales"=sum(unitprice * quantity) (regla group by)
# tablas: "employees" E  JOIN1 "orders" O, key(on): E.employeeid = O.employeeid JOIN2 "orderdetails" D, key: O.orderid = D.orderid
# agrupar por(regla): LastName, FirstName
# condicion(having/group by) (unitprice * quantity) < 100000

SELECT LastName, FirstName, sum(unitprice * quantity) as "Total Sales"
FROM "alanparadise/nw"."employees" E  JOIN "alanparadise/nw"."orders" O 
ON E.employeeid = O.employeeid JOIN "alanparadise/nw"."orderdetails" D
ON O.orderid = D.orderid
GROUP BY LastName, FirstName
HAVING SUM(unitprice * quantity) < 100000

## 3 Way JOIN

* JOIN tablas "Employees" y "Orders", key: EmployeeID
* JOIN tablas "Orders" y "Order Details", key: OrderID
* (unitprice*quantity) = "Sales Volume"

In [ ]:
# seleccionar tablas LastName, Firstname, sumar (unitprice * quantity)="Total Sales" (regla group by)
# tablas: "employees" E JOIN1 "orders" O, key:E.employeeid = O.employeeid JOIN2 "orderdetails" D, key:O.orderid = D.orderid
# agrupar por: LastName, FirstName (regla group by)
# ordenar por "Total Sales" descendente, limite 5

SELECT LastName, Firstname,
sum(unitprice * quantity) as"Total Sales"
FROM "alanparadise/nw"."employees" E JOIN"alanparadise/nw"."orders" O ON E.employeeid = O.employeeid JOIN "alanparadise/nw"."orderdetails" D ON O.orderid = D.orderid
GROUP BY LastName, FirstName
Order By 3 desc LIMIT 5;

## Outer JOIN

* Left Outer JOIN: selecciona todas las columnas en intersección + columnas de la tabla izquierda

* Right Outer JOIN: selecciona todas las columnas en intersección + columnas de la tabla derecha

In [ ]:
# seleccionar columnas: LastName, Firstname, contar 'OrderID'="Order Total"
# tablas: "employees" E LEFT OUTER JOIN "orders", key:E.employeeid = O.employeeid, columnas en intersección  "employees"-"orders" + columnas de tabla "employees"
# agrupar por: LastName, FirstName (regla group by)
# ordenar por: contar 'OrderID'

SELECT LastName, Firstname, count(OrderID) as "Order Total"
FROM "alanparadise/nw"."employees" E LEFT OUTER JOIN "alanparadise/nw"."orders" O on E.employeeid = O.employeeid
GROUP BY LastName, FirstName
Order By 3 desc;

In [ ]:
# QUERY EXTERNO
# seleccionar columnas: (unica) customerid
# tabla "orders"
# condicion(where): customerid no en tabla 

# QUERY INTERNO
# seleccionar columnas: customerID
# tabla "customers"

SELECT DISTINCT customerid
FROM "alanparadise/nw"."orders"
WHERE customerid NOT IN (
SELECT customerID FROM "alanparadise/nw"."customers");


# seleccionar columnas: (unica) O.customerid
# tabla "orders" O LEFT OUTER JOIN "customers" C  columnas  en intersección + columnas tabla "orders", key: C.customerid = O.customerid 
# condicion(where) C.customerid es NULL 
SELECT DISTINCT O.customerid
FROM "alanparadise/nw"."orders" O LEFT OUTER JOIN
"alanparadise/nw"."customers" C on
C.customerid = O.customerid
WHERE C.customerid is NULL

In [ ]:

# seleccionar columnas: (caracter) sumar (unitprice * quantity) = "Total Sales"
# tablas: "customers" C JOIN "orders" O, key: C.customerid = O.customerid JOIN "orderdetails" D, key: O.orderid = D.orderid

SELECT to_char(sum(unitprice * quantity),'999,999.99') as"Total Sales"
FROM "alanparadise/nw"."customers" C JOIN "alanparadise/nw"."orders" O ON C.customerid = O.customerid JOIN "alanparadise/nw"."orderdetails" D ON O.orderid = D.orderid

In [ ]:
# 2.1 Are there any Northwinds employees that have no orders?    

# seleccionar  columnas: E.employeeid, lastname, firstname, contar (orderid) 
# tablas: "employees" E LEFT OUTER JOIN "orders" O, key: E.employeeid = O.employeeid 
# agrupar por: E.employeeid, lastname, firstname (regla group by)
# ordenar por: E.employeeid

SELECT E.employeeid, lastname, firstname, count(orderid) 
FROM "alanparadise/nw"."employees" E LEFT OUTER JOIN "alanparadise/nw"."orders" O  ON E.employeeid = O.employeeid 
GROUP BY E.employeeid, lastname, firstname
ORDER BY E.employeeid;

In [ ]:
# 2.2 Are there any Northwinds customers that have no orders?  

# seleccionar columnas: C.customerid, companyname, contar(orderid)
# tablas: "customers" C  LEFT OUTER JOIN "orders", key:C.customerid = O.customerid 
# agrupar por: C.customerid, companyname (regla group by)
# condicion(having) count(orderid) = 0

SELECT C.customerid, companyname, count(orderid)
FROM "alanparadise/nw"."customers" C  LEFT OUTER JOIN "alanparadise/nw"."orders" O  ON C.customerid = O.customerid 
GROUP BY C.customerid, companyname
HAVING count(orderid) = 0;

In [ ]:
# Are there any Northwinds orders that have bad (not on file) customer numbers? 

# seleccionar columnas: (unicas) O.customerid, contar(orderid)
# tablas: "orders" O LEFT OUTER JOIN "customers" C, key:C.customerid = O.customerid
# condicion(where)  C.customerid es NULL
# agrupar por  O.customerid (regla grou by)

SELECT DISTINCT O.customerid, count(orderid)
FROM "alanparadise/nw"."orders" O LEFT OUTER JOIN "alanparadise/nw"."customers" C on C.customerid = O.customerid 
WHERE C.customerid is NULL
GROUP BY O.customerid;

In [ ]:
# 2.4 Are there any Shippers that have shipped no Northwinds orders?   

# seleccionar columnas: S.shipperid, companyname, contar (orderid)
# tablas: "shippers" S  LEFT OUTER JOIN  "orders" O, key: S.shipperid = O.shipvia 
# agrupar por: S.shipperid, companyname (regla group by)

SELECT S.shipperid, companyname, count(orderid)
FROM "alanparadise/nw"."shippers" S  LEFT OUTER JOIN "alanparadise/nw"."orders" O  ON  S.shipperid = O.shipvia 
GROUP BY S.shipperid, companyname;

# DDL y DML

## DDL

CREATE: crear nueva tabla o vista
* Define el nombre de la tabla y las columnas
* Define el tipo de dato y tamaño de cada columna
* Define restricciones para cada columna
* Se hace DROP  a la tabla (si existe) antes de crear una nueva 

DROP TABLE IF EXISTS "alanparadise/nw"."shippers"

ALTER 

DROP

## DML: crear, quitar y modificar valores

* INSERT INTO: 
* UPDATE:
* DELETE:
* TRUNCATE:

In [ ]:
CREATE TABLE <table name>
(<column name> <DATATYPE(L)>,
<column name> <DATATYPE(L)> NOT NULL,
<column name> <DATATYPE> NOT NULL Default 0,
<column name> <DATATYPE> CONSTRAINT <constraint name> <TYPE>,
<column name> <DATATYPE(L)>)

In [ ]:
DROP TABLE IF EXISTS "alanparadise/nw"."shippers"

In [ ]:
# crear tabla: "shippers"
# columnas: ShipperID tipo int NONULL, CompanyName caracteres (40) NOT NULL, Phone caracteres (20) NOT NULL default=0

CREATE TABLE "alanparadise/nw"."shippers"
(
ShipperID int NOT NULL ,
CompanyName varchar(40) NOT NULL ,
Phone varchar(20) NOT NULL DEFAULT '0'
);

INSERT INTO <tabla> VALUES (val1,val2,val3);

In [ ]:
# insertar valores
# tabla: "shippers"
# valores
INSERT INTO "alanparadise/nw"."shippers" VALUES (1, 'Speedy Express', '(503) 555-9831');

INSERT INTO "alanparadise/nw"."shippers" VALUES (2, 'United Package', '(503) 555-3199');

INSERT INTO "alanparadise/nw"."shippers" VALUES (3, 'Federal Shipping');

In [ ]:
# crear tabla: "items" 
# columnas: itemID int no null, itemcode caracteres=5 NULL, itemname caracteres=40 NO NULL default='', quantity int NO NULL default=0, price real  NOT NULL default=0


CREATE TABLE "your_bit.io_account/demo_repo"."items" 
( 
    itemID     INT         NOT NULL ,
    itemcode   VARCHAR(5)  NULL,
    itemname   VARCHAR(40) NOT NULL DEFAULT ' ',
    quantity   INT         NOT NULL DEFAULT 0,
    price      REAL	    NOT NULL DEFAULT 0
  );

In [ ]:
# insertar en tabla: "items"
# seleccionar columnas productid, concat(supplierid, categoryid,discontinued), productname, unitsinstock, unitprice
# tabla: "products"
INSERT INTO "your_bit.io_account/demo_repo"."items"
(SELECT productid, concat(supplierid, categoryid,discontinued), productname, unitsinstock, unitprice 
FROM "alanparadise/nw"."products");

## CONSTRAINTS

Regla o restricción para mantener integridad de los datos en la base de datos

Se puede aplicar restricciones a nivel de la tabla o de la columna

Restricciones de tabla:

* Primary Key
* Foreign Key


Restricciones de columna:
* NOT NULL
* Cheack: aplica una condición sobre la columna
* Default
* Unique: previene insertar una fila con valor duplicado
* Primary  Key: incluye una restricción UNIQUE

## ALTER
Cambiar las características de la base de datos 

Tabla
* Renombrar tabla, columna o restriccion
* agregar o eliminar columna o restriccion


Columna
* set o eliminar default
* set un tipo de dato

In [ ]:
# quitar tabla "items"
# crear tabla "items"
# columnas: itemID NO NULL, itemcode string 5 NULL,itemname string 40 NOT NULL default='',quantity int NOT NULL default=0, price REAL NOT NULL default=0

DROP TABLE IF EXISTS "alanparadise/nw"."items";
CREATE TABLE "alanparadise/nw"."items"
(
itemID INT NOT NULL ,
itemcode VARCHAR(5) NULL,
itemname VARCHAR(40) NOT NULL DEFAULT ' ',
quantity INT NOT NULL DEFAULT 0,
price REAL NOT NULL DEFAULT 0
);


# insertar en tabla: "items"
# seleccionar columnas: productid, concat(supplierid, categoryid, discontinued, productname, unitsinstock, unitprice
# tabla: "products"

INSERT INTO "alanparadise/nw"."items"
(SELECT productid, concat(supplierid, categoryid, discontinued),
productname, unitsinstock, unitprice
from "alanparadise/nw"."products");

In [ ]:
# cambiar tabla: "items"
# renombrar tabla: "alters"
ALTER TABLE "alanparadise/nw"."items"
RENAME TO "alters";

In [ ]:
# cambiar tabla: "alters"
# renombrar columna: "itemcode" a "itemref"
ALTER TABLE "alanparadise/nw"."alters"
RENAME COLUMN "itemcode" TO "itemref";

In [ ]:
# cambiar tabla: "alters"
# agregar columna: itemcode, string 5, NULL
ALTER TABLE "alanparadise/nw"."alters"
ADD COLUMN "itemcode" VARCHAR(5) NULL;

In [ ]:
# actualizar tabla "alters"
# set "itemcode" = "itemref" 
UPDATE "alanparadise/nw"."alters"
SET "itemcode" = "itemref";

In [ ]:
# cambiar tabla: "alters"
# cambiar columna: itemcode set tipo de dato char 4
ALTER TABLE "alanparadise/nw"."alters"
ALTER COLUMN "itemcode" SET DATA TYPE char(4);

In [ ]:
# cambiar tabla: alters
# quitar columna: itemcode
ALTER TABLE "alanparadise/nw"."alters"
DROP COLUMN "itemcode";

In [ ]:
# cambiar tabla:"items" 
# renombrar tabla:"demo"
ALTER TABLE "your_bit.io_account/demo_repo"."items" 
RENAME TO "demo";

In [ ]:
# cambiar tabla: "demo" 
# renombrar columna: itemcode TO itemclass
ALTER TABLE "your_bit.io_account/demo_repo"."demo" 
RENAME COLUMN "itemcode" TO "itemclass";

In [ ]:
# cambiar tabla: "demo" 
# agregar columna: iteminfo strin 5 NULL 
ALTER TABLE "your_bit.io_account/demo_repo"."demo" 
ADD COLUMN "iteminfo" VARCHAR(5) NULL;

In [ ]:
# actualizar tabla: "demo" 
# set: iteminfo = itemclass
UPDATE "your_bit.io_account/demo_repo"."demo" 
SET "iteminfo" = "itemclass";

## INSERT

In [ ]:
# si no se especifican columnas o valores, entonces NULL o default se asignan
INSERT INTO <table name> (column, column, column)
VALUES (value, value, value)

In [ ]:
# debe especificar valor o NULL para cada columna
INSERT INTO <table name>
VALUES (value, value, value, value)

In [ ]:
# insertar en tabla: "employees"
# columnas: 
# valores
INSERT INTO "alanparadise/nw"."employees"
(employeeid, LastName, FirstName, Title, TitleOfCourtesy, BirthDate, HireDate,
Address, City, Region, PostalCode, Country, HomePhone, Extension)
VALUES
(10,'Dunn','Nat','Sales Representative', 'Mr.', '1970-02-19', '2014-01-15',
'4933 Jamesville Rd.','Jamesville','NY', '13078','USA',
'315-555-5555','130');

In [ ]:
# insertar en tabla: "employees"
# columnas: NO especificado
# valores: NULL obligatorio para columnas NULL 

INSERT INTO "alanparadise/nw"."employees"
VALUES
('20','Thomas','Tammy','Data Scientist','Ms.','1990-08-27',
'2017-06-18', '5012 Arapahoe St.','Boulder','CO', '80304','USA');
INSERT INTO "alanparadise/nw"."employees"
VALUES
('21','Thomas','Tommy','Data Analyst', 'Mr.','1991-09-28', '2017-06-18',
'5014 Arapahoe St.','Boulder','CO', '80304','USA',NULL,NULL,NULL,NULL,NULL);

## UPDATE
Asigna valores nuevos a columnas por  condicion

In [ ]:
UPDATE <table name>
SET <column> = <new value>

In [ ]:
# actualizar tabla:"employees"
# set: firstname = 'Timmy', titleofcourtesy = 'Mr.'
# condicion(where)  employeeid = 20
UPDATE "alanparadise/nw"."employees"
SET firstname = 'Timmy',
titleofcourtesy = 'Mr.'
WHERE employeeid = 20

## TRUNCATE
Quitar todas las filas, mantiene estructura

In [ ]:
TRUNCATE TABLE <table name>

## DROP
Quita toda las filas, quita estructura

In [ ]:
DROP TABLE <table name>

## DELETE

Quitar filas por condicion

In [ ]:
DELETE FROM <table name>
WHERE <condition>

In [ ]:
# quitar tabla: "employees"
# condicion(where): employeeid in (10, 20, 21)
DELETE FROM "alanparadise/nw"."employees"
WHERE employeeid in (10, 20, 21)

In [ ]:
NSERT INTO "alanparadise/nw"."items"
(SELECT productid, concat(supplierid, categoryid, discontinued),
productname, unitsinstock, unitprice
from "alanparadise/nw"."products")

In [ ]:
# insertar en tabla: "demo"
# columnas: itemid, itemclass, itemname, quantity, price, iteminfo
# valores: 
INSERT INTO "your_bit.io_account/demo_repo"."demo"
    		(itemid, itemclass, itemname, quantity, price, iteminfo)
VALUES 
  		(101,'1234','Spicy Grillmate', 12, 1.99, '1234');

In [ ]:
# insertar en tabla:
# valores
INSERT INTO "your_bit.io_account/demo_repo"."demo"
    	  VALUES 
(102,'6789','GlobalWarmer', 24, 42.99, '6789');

In [ ]:
# actualizar tabla: "demo" 
# set: iteminfo = '0000'
# condicion(where) itemid > 100
UPDATE "your_bit.io_account/demo_repo"."demo" 
    		SET "iteminfo" = '0000'
		WHERE itemid > 100;

In [ ]:
# quitar de tabla:"demo" 
# condicion:itemid > 100
DELETE FROM "your_bit.io_account/demo_repo"."demo" 
WHERE itemid > 100;

In [ ]:
# quitar tabla: "demo"
DROP TABLE "your_bit.io_account/demo_repo"."demo";

## SQL VIEWS 

Tabla virtual. Cada vez que se hace Query sobre VIEW se re-ejecuta el query

In [ ]:
CREATE VIEW <view name> AS
SELECT <col1>, <col2>, <col3>
FROM <table1>
WHERE <condition>

In [ ]:

# crear VIEW: "TopEmployeesOrders" AS
# seleccionar columnas: LastName, Firstname, sumar(unitprice * quantity) ="Total Sales" (regla group by )
# tablas:  "employees" E  JOIN "orders" O, key: E.employeeid = O.employeeid,  JOIN "orderdetails" D, key: O.orderid = D.orderid
# agrupar por: LastName, FirstName (regla group by)
# ordenar por "Total Sales"descendiente limite 5

CREATE VIEW "alanparadise/nw"."TopEmployeesOrders" AS
SELECT LastName, Firstname, sum(unitprice * quantity) as"Total Sales"
FROM "alanparadise/nw"."employees" E  JOIN "alanparadise/nw"."orders" O ON E.employeeid = O.employeeid JOIN "alanparadise/nw"."orderdetails" D ON O.orderid = D.orderid
GROUP BY LastName, FirstName
Order By 3 desc LIMIT 5;

In [ ]:
# seleccionar columnas: TODAS
# tabla: VIEW "TopEmployeesOrders"
Select * 
from "alanparadise/nw"."TopEmployeesOrders";

## CASE
 Condicionales (if, elif, else)

CASE
WHEN <condition_1> THEN <result_1>
WHEN <condition_2> THEN <result_2>
WHEN <condition_3> THEN <result_3>
ELSE <else_result> (this results if the prior conditions are all false)
END

In [ ]:
# seleccionar columnas: productid, productname, unitprice
# CASE: 
# if unitprice <20,  'Economy'
# if unitprice <80, 'Standard'
# else 'Premium'
# end columna: category
# tabla:  "products"

SELECT productid, productname, unitprice,
CASE
WHEN unitprice < 20 THEN 'Economy'
WHEN unitprice < 80 THEN 'Standard'
ELSE 'Premium'
END category
FROM "alanparadise/nw"."products";

In [ ]:
# crear VIEW: "TopCustomers" as
# seleccionar columnas: companyname, sumar(unitprice * quantity)="Total Sales" (regla group by)
# CASE:
# if  sum(unitprice * quantity) < 60000, 'NeedsFocus'
# if sum(unitprice * quantity)<110000, 'Average'
# else 'Outstanding'
# end column: Assessment
# tablas: "customers" C JOIN "orders" O, key: C.customerid  =  O.customerid, JOIN "orderdetails" D, key: O.orderid  =  D.orderid
# agrupar por: companyname (regla group by)
# ordenar por "Total Sales" descendiente limite 5

create view "your_bit.io_account/demo_repo"."TopCustomers" as 
SELECT companyname, sum(unitprice * quantity) as "Total Sales",
CASE  
    WHEN sum(unitprice * quantity) < 60000 THEN 'NeedsFocus'
    WHEN sum(unitprice * quantity) < 110000 THEN 'Average'
    ELSE 'Outstanding'
END  Assessment

FROM "alanparadise/nw"."customers" C JOIN "alanparadise/nw"."orders" O ON C.customerid  =  O.customerid JOIN  "alanparadise/nw"."orderdetails" D ON O.orderid  =  D.orderid
GROUP BY companyname 
Order By 2 desc LIMIT 5;

## UNION

Combinar múltiples tablas en una sola

Ambas tablas deben tener el mismo número de columnas y columnas de tablas en UNION deben ser del mismo tipo

In [ ]:
# seleccionar columnas: categoryname, sumar(unitsinstock)  (regla group by)
# tablas:"categories" C JOIN  "products" P , key: C.categoryid = P.categoryid
# group by categoryname (regla group by)

SELECT categoryname, sum(unitsinstock)
FROM "alanparadise/nw"."categories" C JOIN "alanparadise/nw"."products" P ON C.categoryid = P.categoryid
GROUP BY categoryname;

In [ ]:
# seleccionar: 'Total', sumar(unitsinstock)
# tabla: "products"
SELECT 'Total', sum(unitsinstock)
FROM "alanparadise/nw"."products";

In [ ]:
# seleccionar columnas: categoryname, sumar(unitsinstock)=CategoryTotal
# tablas: "categories" C JOIN "products" P, key: C.categoryid = P.categoryid
# group by  categoryname (regla group by)
# UNION

# seleccionar columnas 'Total', sumar (unitsinstock)
# tabla: "products"
# ordenar por 'Total'

SELECT categoryname, sum(unitsinstock) as CategoryTotal
FROM "alanparadise/nw"."categories" C JOIN "alanparadise/nw"."products" P ON C.categoryid = P.categoryid
GROUP BY categoryname

UNION

SELECT 'Total', sum(unitsinstock)
FROM "alanparadise/nw"."products"
ORDER BY 1;

In [ ]:
# 1. List  the names of the cities in alphabetical order where Classic Models has offices. (7)


FALTA TERMINAR

In [ ]:
# 2. List the EmployeeNumber, LastName, FirstName, Extension for all employees working out of the Paris office. (5) 

SELECT E.officecode,EmployeeNumber, LastName, FirstName, Extension
FROM "alanparadise/cm"."employees" E JOIN  "alanparadise/cm"."offices" O ON E.officecode = O.officecode 
WHERE NOT O.city like 'Paris';

In [ ]:
# 3. List the ProductCode, ProductName, ProductVendor, QuantityInStock and ProductLine for all products with a QuantityInStock between 200 and 1200. (11) 
SELECT  ProductCode, ProductName, ProductVendor, QuantityInStock, ProductLine
FROM "alanparadise/cm"."products"
WHERE QuantityInStock BETWEEN 200 AND 1200;

In [ ]:
# 4. (Use a SUBQUERY) List the ProductCode, ProductName, ProductVendor, BuyPrice and MSRP for the least expensive (lowest MSRP) product sold by ClassicModels.  (“MSRP” is the Manufacturer’s Suggested Retail Price.)  (1)    
# seleccionar columnas: Productcode, ProductName,  productvendor, buyprice, MSRP
# tabla: "products"
# condicion(where)

# SUBQUERY 
# seleccionar columnas: minimo (msrp) 
# tabla: "products"
SELECT Productcode, ProductName,  productvendor, buyprice, MSRP   
FROM products  
WHERE MSRP = ( 
 	    SELECT min(msrp) from products)

In [ ]:
# 5. What is the ProductName and Profit of the product that has the highest profit (profit = MSRP minus BuyPrice). (1)

# selecionar columnas: ProductName,  PROFIT=(MSRP – BuyPrice)
# tabla: "alanparadise/cm"."products"
# ordenar por: profit descendiente limite 1 
SELECT ProductName, (MSRP – BuyPrice) as PROFIT   
FROM "alanparadise/cm"."products"
order by profit desc limit 1;

In [ ]:
# List the country and the number of customers from that country for all countries having just two  customers.  List the countries sorted in ascending alphabetical order. Title the column heading for the count of customers as “Customers”. (7) 

# seleccionar columnas: (unicas) , country, customers = COUNT(*) (regla group by)
# tabla: "Customers"
# group by country
# condicion (having) contar(*) = 2 clientes
# ordenar por country ascendente
Select DISTINCT country, count(*) as customers
FROM "alanparadise/cm"."Customers"
GROUP BY country
HAVING count(*) = 2 
ORDER BY 1 asc;

In [ ]:
# List the ProductCode, ProductName, and number of orders for the products with exactly 25 orders.  Title the column heading for the count of orders as “OrderCount”.  (12)  

SELECT P.productcode, productname, count(ordernumber) as OrderCount  	
FROM products P join orderdetails O ON p.productcode = o.productcode     
GROUP BY productcode, productname 
HAVING OrderCount = 25;

In [ ]:
# List the EmployeeNumber, Firstname + Lastname  (concatenated into one column in the answer set, separated by a blank and referred to as ‘name’) for all the employees reporting to Diane Murphy or Gerard Bondur. (8)  
SELECT EmployeeNumber, concat(firstname,' ',lastname) as "Name"
FROM "alanparadise/cm"."employees"
WHERE reportsto in (1002, 1102);

In [ ]:
# List the EmployeeNumber, LastName, FirstName of the president of the company (the one employee with no boss.)  (1)  
SELECT EmployeeNumber, LastName, FirstName
FROM "alanparadise/cm"."employees"
WHERE reportsto IS null;

In [ ]:
# List the ProductName for all products in the “Classic Cars” product line from the 1950’s.  (6)

Select Productname, Productline  
FROM "alanparadise/cm"."products"
WHERE productline = "Classic Cars" AND 
productname like "195%" 
ORDER BY productname;

In [ ]:

# List the month name and the total number of orders for the month in 2004 in which ClassicModels customers placed the most orders. (1)  
# seleeccionar columnas:  contar(ordernumber), ordermonth  = monthname(orderdate)
# "alanparadise/cm"."orders "
# condicion(where) extraer year from orderdate = 2004
# agrupar  ordermonth 
# ordenar por 1 desc limit 1


SELECT COUNT(ordernumber), monthname(orderdate) as ordermonth  
FROM orders  
WHERE extract(year from orderdate) = '2004' 
group by ordermonth 
order by 1 desc limit 1;

In [ ]:
# List the firstname, lastname of employees who are Sales Reps who have no assigned customers.  (2) 

# seleccionar columnas: firstname, lastname
# tablas: "employees" E LEFT OUTER JOIN "Customers" C   employees+interseccion, key: E.employeenumber = C.salesrepemployeenumber
# condicion(where): customername is null 
#  condicion(where): jobtitle  = "Sales Rep"
SELECT firstname, lastname
FROM "alanparadise/cm"."employees" E LEFT OUTER JOIN "alanparadise/cm"."Customers" C ON E.employeenumber = C.salesrepemployeenumber 
WHERE customername is null and
jobtitle  = "Sales Rep"

In [ ]:
# List the customername of customers from Switzerland with no orders. (2)  
# seleccionar columnas: customername
# tablas: "Customers" C LEFT OUTER JOIN "orders" O  customers+interseccion, key: C.customernumber = O.customernumber 
# condicion(where): country  = 'Switzerland
# condicion(where): O.customernumber is null

SELECT customername
FROM "alanparadise/cm"."Customers" C LEFT OUTER JOIN "alanparadise/cm"."orders" O ON C.customernumber = O.customernumber 
WHERE country  = 'Switzerland' and O.customernumber is null;

In [ ]:
# List the customername and total quantity of products ordered for customers who have ordered more than 1650 products across all their orders.  (8) 

# seleccionar columnas: customername, totalq =sumar(quantityordered) (regla group by)
# tablas: c join orders o, key: c.customernumber = o.customernumber, JOIN orderdetails d, key: o.ordernumber = d.ordernumber
# group by:customername
# condicion(having) totalq > 1650

SELECT customername, sum(quantityordered) as totalq 
FROM customers c join orders o on c.customernumber = o.customernumber join orderdetails d on o.ordernumber = d.ordernumber 
GROUP BY customername  
HAVING totalq > 1650;

In [ ]:
conn.close()